{
  "recipes": [
    {
      "title": "Cameroonian Njangsa Sauce",
      "description": "I grew up eating this tasty, creamy Cameroonian Njangsa Sauce also known as Njangsa Stew. Serve it with rice, boiled plantains, or boiled African white yams, which is the way I served it here. This stew is easy to make and you can use any protein of choice, including chicken, pork, and beef.",
      "prep_time": "20 minutes",
      "cook_time": "25 minutes",
      "total_time": "45 minutes",
      "servings": 6,
      "course": "Dinner",
      "cuisine": "Cameroonian",
      "diet": "Gluten Free",
      "author": "Precious",
      "ingredients": {
        "fish": [
          "2 pounds whole fish (e.g., pompano)",
          "½ teaspoon salt",
          "1 teaspoon chicken bouillon powder or 1 Maggi seasoning cube",
          "¼ teaspoon ground white pepper"
        ],
        "sauce": [
          "½ cup olive oil or any neutral tasting oil",
          "1 medium onion, diced",
          "4-5 large Roma tomatoes, cut into chunks",
          "7 garlic cloves, peeled",
          "3 inches ginger root, peeled and diced",
          "4 sprigs parsley",
          "4 sprigs basil",
          "½ a large leek or 1 green onion",
          "2 teaspoons ground white pepper",
          "½ cup Njangsa seeds (obtainable from an African market)",
          "1 teaspoon salt",
          "2 teaspoons chicken bouillon powder or 2 small Maggi seasoning cubes",
          "2 habanero peppers or scotch bonnet peppers",
          "Sliced basil or minced parsley for garnishing"
        ]
      },
      "instructions": [
        "Trim the fins of the fish with kitchen scissors and cut the fish into steaks. Remove the entrails and rinse thoroughly until the water runs clear. You could have your fish monger clean and gut the fish for you.",
        "Season the fish with the salt, white pepper, chicken bouillon powder or one small Maggi seasoning cube. Let it rest while you work on the sauce.",
        "Add oil to a medium pot set on medium-high heat, then let the oil heat up until shimmering. Add the diced onions, and sauté for about a minute until fragrant. Blend the tomatoes into a paste and add to the pot. Let them cook undisturbed for 5 minutes. Stir the tomatoes and let them continue to cook until they start sticking to the bottom of the pot. Another 5 minutes.",
        "Blend together the leeks or green onion, parsley, basil, garlic, ginger, and njangsa seeds with a cup of water. Pour the blended spices into the pot with tomatoes. Rinse the blender with about 3 cups of water and add to the pot. Stir well to combine. Add the habanero pepper with the remaining salt and bouillon powder. Stir to combine.",
        "Add the seasoned fish steaks to the pot. Cover and let it cook for about ten to fifteen minutes until the fish is completely cooked through. Spoon some of the sauce over the fish as they cook. Avoid stirring as this might break the fish.",
        "Taste and adjust seasoning or thickness if needed. If you want a lighter sauce, thin it out with water then taste to see if it needs a pinch of salt.",
        "Garnish with fresh sliced basil or minced parsley. Serve with boiled rice, plantains or African white yams."
      ],
      "notes": [
        "Other kinds of fish you could use include mackerel, snapper, sea bass, sea bream, and tilapia.",
        "I use Roma tomatoes nine times out of ten because they have more flesh and less acidity. But you could use other kinds of tomatoes if that's all you've got.",
        "Fresh spices are best for this recipe as they really complement the flavor of the fish. Take time to peel fresh garlic and ginger for the best flavor."
      ],
      "nutrition": {
        "calories": "406 kcal",
        "carbohydrates": "7 g",
        "protein": "34 g",
        "fat": "27 g",
        "saturated_fat": "4 g",
        "polyunsaturated_fat": "3 g",
        "monounsaturated_fat": "14 g",
        "cholesterol": "76 mg",
        "sodium": "910 mg",
        "potassium": "628 mg",
        "fiber": "2 g",
        "sugar": "3 g",
        "vitamin_a": "446 IU",
        "vitamin_c": "14 mg",
        "calcium": "37 mg",
        "iron": "1 mg"
      },
      "image": "https://www.preciouscore.com/wp-content/uploads/2016/03/Cameroonian-Njangsa-Sauce-300x300.jpg"
    },
    {
      "title": "How To Make Chin Chin",
      "description": "It tastes like cake but it's crunchy, rich in flavor, and so addictive. Here is your step-by-step guide on how to make Chin Chin.",
      "prep_time": "25 minutes",
      "cook_time": "30 minutes",
      "total_time": "55 minutes",
      "servings": 10,
      "course": ["Dessert", "Snack"],
      "cuisine": "African",
      "author": "Precious",
      "ingredients": [
        "5 cups all-purpose flour",
        "½ cup granulated sugar",
        "1 teaspoon baking powder",
        "1 teaspoon salt",
        "½ teaspoon ground nutmeg",
        "1 teaspoon orange zest from one orange",
        "1 cup evaporated milk (not sweetened)",
        "½ cup margarine or softened salted butter",
        "2 large eggs",
        "Neutral oil for frying (e.g., canola oil or vegetable oil)"
      ],
      "instructions": [
        "In a large mixing bowl or the bowl of a stand mixer, whisk together the flour, sugar, baking powder, salt, grated nutmeg, and orange zest. Add the evaporated milk, margarine, and eggs, then mix to form a dough, kneading by hand or with the machine.",
        "Cut a small portion of the dough about the size of a golf ball then roll out to 1/8 inch thick and cut with a knife or pizza cutter into squares or thin strips. You could also use a pasta maker to cut the dough into strips. Place the cut dough on a baking sheet or tray lined with parchment paper.",
        "Pour oil into a heavy bottom pot like a cast iron pot up to 4 inches. Heat the oil on high heat for about 10 minutes then reduce the heat to medium and start frying chin chin in small batches. Be careful not to overcrowd the pan so the chin chin doesn't soak up the oil or cause a lot of foam. Fry each batch until golden brown then remove and place on paper towels to drain the excess oil.",
        "When chin chin cools completely, store it for up to a month in an airtight container. Enjoy as a snack with juice, milk, or your favourite drink!"
      ],
      "notes": [
        "Do not overcrowd the pan when frying chin chin. Overcrowding the pan will cause the oil to foam and it might even overflow. We want to avoid that.",
        "You could replace evaporated milk with whole milk.",
        "This recipe was first published on April 21st, 2017, and then updated on December 13, 2019, with more pictures. Now the recipe has been tweaked to make a better dough, some portions rewritten for more clarity and the whole post has been refreshed with newer photos."
      ],
      "nutrition": {
        "calories": "481 kcal",
        "carbohydrates": "61 g",
        "protein": "10 g",
        "fat": "11 g",
        "saturated_fat": "2 g",
        "polyunsaturated_fat": "3 g",
        "monounsaturated_fat": "5 g",
        "trans_fat": "0.003 g",
        "cholesterol": "34 mg",
        "sodium": "425 mg",
        "potassium": "170 mg",
        "fiber": "2 g",
        "sugar": "13 g",
        "vitamin_a": "555 IU",
        "vitamin_c": "1 mg",
        "calcium": "116 mg",
        "iron": "3 mg"
      },
      "image": "https://www.preciouscore.com/wp-content/uploads/2023/12/How-To-Make-Chin-Chin-300x300.jpg"
    },
    {
      "title": "African Pepper Sauce",
      "description": "This African Pepper Sauce is a hot sauce made with hot peppers, spices, and herbs. The perfect accompaniment to any meal!",
      "prep_time": "15 minutes",
      "cook_time": "30 minutes",
      "total_time": "45 minutes",
      "servings": 20,
      "course": "Appetizer",
      "cuisine": "African",
      "diet": ["Gluten Free", "Vegan", "Vegetarian"],
      "author": "Precious",
      "ingredients": [
        "6 roma tomatoes, cut into quarters",
        "1 red onion, cut into chunks",
        "4 habanero peppers, stems removed",
        "6 sprigs parsley, rinsed, hard stems removed",
        "6 sprigs basil, rinsed, leaves plucked from hard stems",
        "2 inches ginger root, peeled and diced",
        "6 cloves garlic, peeled",
        "1 teaspoon salt",
        "2 tablespoons olive oil",
        "1 teaspoon dried thyme (optional)",
        "1 teaspoon dried basil (optional)"
      ],
      "instructions": [
        "Add all the ingredients to a blender and blend into a paste.",
        "Pour the pepper mixture into a small pot. Add in the olive oil and dried herbs (if using). Bring the pot to a boil on medium heat and let it simmer on low heat for about 20 minutes, stirring from time to time to prevent burning.",
        "Adjust the salt if necessary and turn off the heat.",
        "Store pepper sauce in small airtight jars for up to a week in the refrigerator."
      ],
      "notes": [
        "The best way to adjust the level of heat in this pepper sauce is to reduce the quantity of habanero peppers used. For a more mild sauce, use two or three peppers instead of four.",
        "This sauce makes a great marinade for grilled meats or fish.",
        "For a thicker sauce, let it cook for a longer time, or reduce the quantity of tomatoes used."
      ],
      "nutrition": {
        "calories": "14 kcal",
        "carbohydrates": "3 g",
        "protein": "1 g",
        "fat": "1 g",
        "saturated_fat": "0.1 g",
        "polyunsaturated_fat": "0.2 g",
        "monounsaturated_fat": "0.7 g",
        "sodium": "118 mg",
        "potassium": "106 mg",
        "fiber": "1 g",
        "sugar": "2 g",
        "vitamin_a": "325 IU",
        "vitamin_c": "9 mg",
        "calcium": "12 mg",
        "iron": "0.3 mg"
      },
      "image": "https://www.preciouscore.com/wp-content/uploads/2023/05/African-Pepper-Sauce-1-300x300.jpg"
    },
    {
      "title": "Cameroonian Pepper Soup",
      "description": "Brothy, hearty soup made up of tender chunks of meat. The broth in this Cameroonian Pepper Soup is so flavorful, you will want to keep drinking it! The soup is really flavorful with a little kick but not spicy! If you want it spicy, blend the habanero or scotch bonnet peppers with the other ingredients.",
      "prep_time": "15 minutes",
      "cook_time": "1 hour 15 minutes",
      "total_time": "1 hour 30 minutes",
      "servings": "10 servings",
      "author": "Precious",
      "ingredients": [
        "10 pounds goat meat, beef feet, and oxtails",
        "2 teaspoons salt",
        "4 teaspoons chicken bouillon powder",
        "1 medium onion",
        "1 head of garlic (about 10 cloves)",
        "4 inches ginger root",
        "5 sprigs fresh basil (used Thai basil)",
        "4 sprigs parsley",
        "1 celery stalk",
        "1/2 cup njangsa",
        "2 habanero or scotch bonnet peppers",
        "1 teaspoon ground white pepper"
      ],
      "instructions": [
        "Rinse all the meats and add to a large pot. Add enough water to the pot to completely cover the meats.",
        "Place the pot on high heat and cover it with the lid tilted on one side to prevent boiling over. Bring to a boil and let it boil for 10 minutes. Skim the scum off the top of the meats.",
        "As the meat boils, combine the onion (cut into chunks), garlic, ginger, basil, parsley, celery, and njangsa. Add enough water to blend into a paste and blend everything into a smooth paste. If you want the soup spicy, blend all the ingredients together with a habanero pepper.",
        "Add the seasoning blend to the meats, then add the salt and chicken bouillon powder, and the full habanero peppers. Let it simmer together until the meats are all tender. It takes about an hour. After 30 minutes, remove the habanero peppers so they don't burst into the soup.",
        "Taste the broth and adjust the salt as needed. Add the ground white pepper and stir to combine. Let it simmer for about 2 minutes with the white pepper.",
        "Garnish with chopped basil or parsley if desired.",
        "Serve pepper soup hot with boiled plantains (semi-ripe or unripe), boiled African white yam or rice."
      ],
      "notes": [
        "Meats: You could use different cuts of meat in this protein or only one kind of meat. Try making this with just chuck roast (will cook longer) or with beef short ribs. Meats with bone add more flavor to the soup.",
        "Different Protein: You could make pepper soup with chicken or fish as well. Cooking times will vary, depending on the protein used. Fish cooks a lot faster.",
        "Njangsa replacement: Sorry I don't know of a replacement for Njangsa. You could try getting it on Amazon or search for an African store near you. If you can't find it, you could definitely make pepper soup without njangsa. It will still be delicious!",
        "Spices: Add other herbs and spices like thyme, bay leaves, cumin, or cloves."
      ],
      "nutrition": {
        "calories": "359 kcal",
        "carbohydrates": "2 g",
        "protein": "60 g",
        "fat": "11 g",
        "saturated_fat": "4 g",
        "polyunsaturated_fat": "0.5 g",
        "monounsaturated_fat": "5 g",
        "cholesterol": "106 mg",
        "sodium": "829 mg",
        "potassium": "1097 mg",
        "fiber": "0.4 g",
        "sugar": "1 g",
        "vitamin_a": "108 IU",
        "vitamin_c": "5 mg",
        "calcium": "63 mg",
        "iron": "6 mg"
      },
      "image": "https://www.preciouscore.com/wp-content/uploads/2023/01/Cameroonian-Pepper-Soup-360x360.jpg"
    },
    {
      "title": "Cabbage and Beef Stew",
      "description": "Hearty stew with cabbage and beef that can be served over rice or with your favorite starchy sides. It is garlicky meaty, so good!",
      "prep_time": "30 minutes",
      "cook_time": "30 minutes",
      "total_time": "1 hour",
      "servings": "6 servings",
      "author": "Precious",
      "ingredients": [
        "1 head cabbage, 4 pounds or use 2 small cabbages equaling about 4 pounds",
        "1 pound beef for stew or use chuck roast",
        "2 medium carrots cut into matchsticks",
        "10 garlic cloves peeled, mashed into a paste or blended",
        "2 inches ginger root, mashed into a paste or blended",
        "½ cup neutral oil (used peanut oil)",
        "1 medium onion, chopped",
        "10 medium tomatoes, diced (use Roma if available)",
        "1 teaspoon ground white pepper",
        "Salt to taste",
        "2 teaspoons chicken bouillon powder"
      ],
      "instructions": [
        "Shred the cabbage. Cut the cabbage into wedges. About 4-6 wedges or up to 8 wedges for a larger cabbage. Shred by slicing the wedges on the slice side of a standard box grater.",
        "Gather any loose cabbage leaves and slice them.",
        "Blanche the cabbage. Bring water to a boil in a large pot. Add 2 teaspoons of salt. Put the cabbage into the pot. Push in with a wooden spoon to completely submerge. Turn off the heat, cover the pot and let it sit for 5 minutes.",
        "Rinse the cabbage. Pass cabbage through a colander. Immediately rinse with cold water to stop the cooking process. Squeeze out excess water from cabbage and set aside.",
        "Cook the beef. Place beef in a pot. Add half a teaspoon of salt, a quarter teaspoon of ground white pepper and 2 tablespoons of the chopped onions. Add one cup of water. Cook beef for 8-10 minutes or until tender.",
        "Sauté onions and tomatoes. Place a pot on high heat. Add oil. Heat up until shimmering. Add onions and sauté for one minute. Add diced tomatoes and cook while stirring from time to time for 15 minutes. It is important to stir tomatoes consistently so they don't burn. The tomatoes will shrink considerably as they cook.",
        "Add aromatics, carrots and beef. Add garlic and ginger paste, then stir for 1 minute. Add white pepper, and stir for 1 minute. Add sliced carrots, stir for 2 minutes. Add back beef with a quarter cup of its broth. Stir and let it simmer for 2 minutes.",
        "Add cabbage and season to taste. Add the cabbage to the pot. Stir well to combine. Add 2 teaspoons of chicken bouillon powder and stir well to combine. Add salt to taste and stir well to combine. I added a loose teaspoon of salt. Let everything simmer together for 2-5 minutes. Taste and adjust seasoning according to taste. Add some cayenne pepper if want some heat.",
        "Serve warm. Serve with steamed rice, plantains or roasted potatoes."
      ],
      "notes": [
        "Try the following variations for your Cabbage and Beef Stew:",
        "Spicy - Add some cayenne pepper when adding the white pepper or for just mildly spicy, add some crushed red pepper flakes instead. If you want it super spicy, blend one habanero pepper and put it.",
        "Different Protein - Try making beef and cabbage stew with chicken instead or any other protein you like.",
        "More Sauce - If you like your cabbage stew saucier, add all of the beef stock to the stew and let it simmer with the other ingredients."
      ],
      "nutrition": {
        "calories": "355 kcal",
        "carbohydrates": "19 g",
        "protein": "21 g",
        "fat": "23 g",
        "saturated_fat": "3 g",
        "polyunsaturated_fat": "6 g",
        "monounsaturated_fat": "13 g",
        "trans_fat": "0.1 g",
        "cholesterol": "47 mg",
        "sodium": "250 mg",
        "potassium": "884 mg",
        "fiber": "6 g",
        "sugar": "10 g",
        "vitamin_a": "4407 IU",
        "vitamin_c": "74 mg",
        "calcium": "108 mg",
        "iron": "3 mg"
      },
      "image": "https://www.preciouscore.com/wp-content/uploads/2022/09/Cabbage-and-Beef-Stew-recipe-360x360.jpg"
    },
    {
      "title": "African Chicken Stew",
      "description": "If you want a stew recipe that is loaded with flavor, hard to stop eating and pairs well with rice, pasta, crusty bread, plantains, potatoes, yams, etc, you're welcome! This African Chicken Stew is so flavorful and perfect for festive days or weekends. This tomato stew is about to become your new favorite stew!",
      "prep_time": "30 minutes",
      "cook_time": "45 minutes",
      "total_time": "1 hour 15 minutes",
      "servings": "8 servings",
      "author": "Precious",
      "ingredients": [
        "10 cloves garlic peeled",
        "2 inches ginger root peeled",
        "6 sprigs parsley",
        "4 sprigs basil",
        "1 stem celery",
        "5 pounds chicken (used a whole chicken)",
        "1 large onion (chopped and divided into 3)",
        "1/2 teaspoon ground white pepper (divided)",
        "3 teaspoons Maggi seasoning cubes (4g) or three teaspoons chicken bouillon powder (divided)",
        "1 teaspoon salt",
        "1 cup vegetable oil or any neutral tasting oil",
        "6 large Roma tomatoes or 8 medium ones",
        "6 oz tomato paste (170g) or double the quantity of tomato sauce",
        "1 teaspoon curry powder"
      ],
      "instructions": [
        "Prepare the seasoning blend. Chop the peeled ginger root and place it in a blender. Rinse and chop the basil, parsley, and celery and add them to the blender. Add the garlic cloves and 1/3 of the chopped onion to the blender. Add a little water to help the blender then blend everything into a smooth paste.",
        "Prep The Chicken. If using a whole chicken, rinse thoroughly then wipe with paper towels. Cut the chicken into desired pieces and place it in a pot. To the chicken, add the salt, 2 Maggi cubes or 2 teaspoons of chicken bouillon powder, a quarter teaspoon of white pepper and half of the seasoning blend. Add enough water to be at the same level as the chicken. Use a wooden spoon to mix everything together so all the ingredients get evenly distributed. Set the chicken on high heat. Cover and bring to a boil. Once it starts to boil, reduce the heat down to medium and let it simmer until chicken is fully cooked. It takes about 30 to 45 minutes depending on the hardness of the chicken.",
        "Using a slotted spoon remove the chicken from the stock and place on a baking sheet lined with a rack. Reserve the chicken stock. Set oven to high broil. Place the chicken in the oven to broil on one side for about 8 minutes. Then remove the chicken, flip to the other side and let it broil for about 5 minutes.",
        "Make the stew. Rinse the tomatoes, cut them in chunks and place them in a blender with another 1/3 of the chopped onion. Blend into a paste (no need to add water before blending). Pour the one cup of oil into a large pot and let it heat up on high heat for about 3 minutes. Add the remaining onion to the oil and quickly stir. Let it saute for about 1-2 minutes.",
        "Add the tomato-onion blend to the oil and let it cook for about 10 minutes -20 minutes while you stir from time to time to prevent burning. Let it cook until the tomatoes significantly dehydrate and it's mostly just the tomatoes and oil left in the pot. Add the tomato paste to the pot and let it cook while stirring continuously until the tomatoes completely dehydrate and there is just tomato and oil in the pot.",
        "Add the remaining half of the green seasoning blend to the pot and stir so the flavors can bloom. Let it cook while you stir from time to time for 2-3 minutes. Add in the reserved chicken stock, the curry powder, the remaining Maggi cube or 1 more teaspoon of chicken bouillon powder. Also add half to one cup of water depending on your preferred level of thickness. Stir everything to combine. Add the broiled chicken to the pot and stir to combine. Let everything simmer for 5 minutes so the chicken can marry the flavors in the stew. Turn off the heat and your African Chicken Stew is done!",
        "Serve stew warm over hot fluffy rice with a side of sweet fried plantains if you like. Store stew in an airtight container in the fridge for up to 5 days or in the freezer for up to a month."
      ],
      "notes": [
        "Most Africans cook with hard chicken - a chicken that is way tougher than the chicken commonly found in America. Hard chicken can be found in African or Asian stores. I have made this stew with regular American chicken as well and it turned out great! With the softer chicken you just have to cook it less and don't add any water when boiling the chicken.",
        "Roma tomatoes are preferable to use in this recipe because they are not as acidic as other kinds of tomato. Also, use those with a rich red color if you can find them. The riper the tomatoes, the less sour the stew.",
        "For spicy hot stew add a habanero or scotch bonnet pepper when blending the tomatoes."
      ],
      "nutrition": {
        "calories": "310 kcal",
        "carbohydrates": "9 g",
        "protein": "5 g",
        "fat": "29 g",
        "saturated_fat": "7 g",
        "polyunsaturated_fat": "8 g",
        "monounsaturated_fat": "12 g",
        "trans_fat": "3 g",
        "cholesterol": "12 mg",
        "sodium": "794 mg",
        "potassium": "410 mg",
        "fiber": "2 g",
        "sugar": "5 g",
        "vitamin_a": "748 IU",
        "vitamin_c": "14 mg",
        "calcium": "30 mg",
        "iron": "1 mg"
      },
      "image": "https://www.preciouscore.com/wp-content/uploads/2019/12/African-Chicken-Stew-360x360.jpg"
    },
    {
      "title": "Ekwang",
      "ethnicity": "Cameroonian",
      "origin": "South West region of Cameroon",
      "prep_time": "1 hour",
      "cook_time": "30 minutes",
      "total_time": "1 hour 30 minutes",
      "servings": "8 people",
      "author": "Precious",
      "ingredients": [
        "8 large macabo cocoyams (white and pink mixed)",
        "6 bunches cocoyam leaves (or spinach/collard greens)",
        "2 pounds smoked fish/stock fish/beef (do a mix or choose one)",
        "1 1/2 cups palm oil",
        "2 cups crayfish",
        "1 habanero pepper - blended (optional)",
        "1 medium sized onion (chopped)",
        "1 teaspoon ground 'contry onions' (rondelles) (optional)",
        "2 tablespoons blended garlic and ginger",
        "1/4 teaspoon white or black pepper",
        "3 seasoning cubes (Maggi) or 1 1/2 large crayfish seasoning cubes (Maggi crevette)",
        "1 teaspoon salt"
      ],
      "instructions": [
        "Peel cocoyams and grate to a paste using a grater with small holes. You could alternatively use a food processor to bring the cocoyams to a paste. Season the paste with a quarter teaspoon of salt and mix together well.",
        "Coat a large pot with palm oil the way you will coat a pan with oil/margarine to bake a cake. Take a teaspoon of cocoyam and place at one end of a leaf and start wrapping until you get to the end. Repeat wrapping process until the paste is finished. Make sure you place your little wraps in criss-cross patterns so the stock goes round well.",
        "Add every other ingredient mentioned above to the wrapped cocoyams. Add 2-4 cups of water and bring to a boil. If you have stock from boiled meat or something, use it instead of water.",
        "Let it cook together for 30 minutes. Half-way through the cooking, check to see if you need to add more water. If the liquid is at the same level as the wraps then it is good. Avoid stirring so you don't unwrap the little wraps. Hold the pot on both handles and shake so every ingredient mixes nicely and evenly. If you must stir, use a wooden spoon and run it around the edges of the pot.",
        "Taste, adjust seasonings if need be and voila! Ekwang is ready! Serve warm."
      ],
      "notes": [
        "The sweetest part is the burnt portion under the pot. My brother and I will fight for this. Enjoy your Ekwang!"
      ],
      "nutrition": {
        "calories": "727 kcal",
        "carbohydrates": "34 g",
        "protein": "44 g",
        "fat": "48 g",
        "saturated_fat": "22 g",
        "polyunsaturated_fat": "6 g",
        "monounsaturated_fat": "16 g",
        "cholesterol": "201 mg",
        "sodium": "1005 mg",
        "potassium": "2603 mg",
        "fiber": "9 g",
        "sugar": "2 g",
        "vitamin_a": "24142 IU",
        "vitamin_c": "78 mg",
        "calcium": "349 mg",
        "iron": "9 mg"
      },
      "image": "https://www.preciouscore.com/wp-content/uploads/2016/12/Ekwang-Cameroon-360x360.jpg"
    },
    {
      "title": "Cameroonian Sese Plantains",
      "ethnicity": "Cameroonian",
      "origin": "Cameroon",
      "prep_time": "20 minutes",
      "cook_time": "1 hour",
      "total_time": "1 hour 20 minutes",
      "servings": "8 servings",
      "author": "Precious",
      "ingredients": [
        "1 pound goat meat (cut into 2 inch slices, sub with cow meat or more dried fish or smoked fish)",
        "2 medium onions (chopped)",
        "1 1/2 teaspoons salt",
        "6 green (unripe) plantains",
        "2 cups dried fish (bones removed)",
        "1/2 cup crayfish",
        "1 cup red palm oil",
        "2-3 inches ginger root (peeled)",
        "6-8 cloves garlic (peeled)",
        "4 Maggi seasoning cubes (4g cubes)",
        "1 habanero or scotch bonnet pepper (optional)",
        "4 cups baby spinach (sub with kale)"
      ],
      "instructions": [
        "Put goat meat in a pot. Pour in water to completely cover the meat. Add in 1/4 cup of the chopped onion and sprinkle in 1/2 teaspoon salt. Cover, bring to a boil and let it cook until the goat meat is tender but still has a bite to it. About 20 minutes.",
        "Peel the plantains. To peel a plantain, cut the ends of the plantain then score the plantains from top to bottom being careful not to wound the flesh of the plantains. Give a 1-inch gap then score the plantain again from top to bottom. Repeat the process two more times. Use your fingers to lift the skin of the plantains off the flesh. It should come off easily.",
        "Rinse the peeled plantains then cut them into coins that are about 1 inch thick.",
        "Add the plantains to the goat meat. Add in water to completely cover the plantains then add in the palm oil.",
        "Crush the crayfish to break it down a little. You could either use this using a blender a small mortar or a Ziploc bag. To crush using a Ziploc bag, place the crayfish into a small Ziploc bag. Press the bag to release all the air then seal the bag. Use a rolling pin to hit on the bag until the crayfish is broken down.",
        "Add the crayfish to the plantains. Mix everything with a wooden spoon to combine. Cover and bring to a boil.",
        "While the pot comes to a boil, blend the garlic and ginger into a paste (I used a small mortar to crush them).",
        "After the pot comes to a boil, add in the blended garlic and ginger, the remaining 1 teaspoon of salt, then sprinkle on the seasoning cubes (Maggi). Also add the habanero pepper if using (I add the full pepper without crushing so it releases a bit of flavor but the meal isn't too spicy).",
        "Stir everything to combine. Cover the pot and let it cook for about 30 minutes until the plantains are very soft and break easily when pierced with a fork. Add more water to the level of the plantains if the water gets low. Sese Plantain needs to be saucy.",
        "Once the plantains are completely cooked, taste to ensure seasoning is perfect. Add more salt if needed.",
        "Roughly chop the spinach and add to the pot. Mix well to combine. Once the vegetables shrink and mix well with everything turn off the heat.",
        "Let the pot rest covered for 5 minutes then serve hot. Serve with some avocado on the side. So good!"
      ],
      "notes": [
        "It is important that you let the plantains cook until very soft. When the plantains are not well cooked they could be hard and the meal will be unappealing.",
        "Traditionally bitterleaf, a leafy green in West Africa is used to make Sese Plantains. Bitterleaf has some bitterness to it which adds a distinct delicious taste to Sese Plantains. Unfortunately I don't have any fresh bitterleaves so I used spinach. You could use kale as well."
      ],
      "nutrition": {
        "calories": "756 kcal",
        "carbohydrates": "47 g",
        "protein": "52 g",
        "fat": "41 g",
        "saturated_fat": "18 g",
        "polyunsaturated_fat": "3 g",
        "monounsaturated_fat": "15 g",
        "trans_fat": "1 g",
        "cholesterol": "151 mg",
        "sodium": "5143 mg",
        "potassium": "1856 mg",
        "fiber": "3 g",
        "sugar": "25 g",
        "vitamin_a": "3022 IU",
        "vitamin_c": "36 mg",
        "calcium": "146 mg",
        "iron": "4 mg"
      },
      "image": "https://www.preciouscore.com/wp-content/uploads/2020/07/Sese-Plantain-360x360.jpg"
    },
    {
      "title": "Homemade Suya Spice",
      "ethnicity": "African",
      "origin": "West Africa",
      "prep_time": "10 minutes",
      "cook_time": "0 minutes",
      "total_time": "10 minutes",
      "servings": "10 tablespoons",
      "author": "Precious",
      "ingredients": [
        "1/4 cup ginger powder",
        "1/4 cup peanut powder (substitute with ground peanuts. Use a cloth to squeeze out oil from the groundnuts before use)",
        "2 small cubes Maggi (seasoning cube)",
        "2 tablespoons red pepper flakes",
        "1 teaspoon salt",
        "1 tablespoon garlic powder",
        "1 tablespoon onion powder",
        "1 teaspoon ground white pepper",
        "1 tablespoon paprika (optional)"
      ],
      "instructions": [
        "Combine all the ingredients in a small blender cup or coffee grinder then blend them until well combined.",
        "Pass the blend through a fine sieve.",
        "Put in an airtight container and keep for use. You could also freeze it if you want.",
        "Use this soya spice to rub on skewered meat before grilling or use as a marinade for chicken or fish."
      ],
      "notes": [
        "Store in an airtight jar and shake before each use."
      ],
      "nutrition": {
        "serving": "1 tablespoon",
        "calories": "57 kcal",
        "carbohydrates": "10 g",
        "protein": "3 g",
        "fat": "1 g",
        "saturated_fat": "0.2 g",
        "polyunsaturated_fat": "0.3 g",
        "monounsaturated_fat": "0.1 g",
        "cholesterol": "0.1 mg",
        "sodium": "498 mg",
        "potassium": "217 mg",
        "fiber": "2 g",
        "sugar": "2 g",
        "vitamin_a": "821 IU",
        "vitamin_c": "0.3 mg",
        "calcium": "24 mg",
        "iron": "2 mg"
      },
      "image": "https://www.preciouscore.com/wp-content/uploads/2017/05/Homemade-suya-spice-recipe-360x360.jpg"
    },
    {
      "title": "Tomato Fish Stew – Cameroonian Fish Stew",
      "description": "This Tomato Fish Stew pairs well with rice. It is garlicky, flavorful with a nice sweetness from the tomatoes.",
      "prep_time": "15 minutes",
      "cook_time": "30 minutes",
      "total_time": "45 minutes",
      "servings": "6 servings",
      "course": "Dinner",
      "cuisine": "African, Cameroonian",
      "author": "Precious",
      "ingredients": [
        "2 whole medium firm fish (see Note 3)",
        "7 cloves garlic",
        "1 inch ginger root, peeled and sliced",
        "4 sprigs basil",
        "1 medium onion, chopped",
        "8 roma tomatoes, super ripe",
        "1 cup oil (canola oil, vegetable oil, corn oil will work) (See Note 2)",
        "1/2 teaspoon ground white pepper",
        "1/2 teaspoon salt",
        "3 Maggi seasoning cubes (4g cubes)",
        "1 habanero or scotch bonnet pepper, optional"
      ],
      "instructions": [
        "Prepare the fish. Use kitchen shears to cut the fins off the fish. Scrape off the scales from the fish using a knife. Cut each fish into 4 pieces. Clean out the entrails of the fish carefully with a knife. Place the fish in a colander and rinse thoroughly under running water.",
        "Prepare the spice blend. Reserve 1 sprig of basil to use later. Place the rest of the basil, garlic, and ginger into a blender. Add about 1/4 cup water and blend into a paste.",
        "Season the fish. Add a tablespoon of the spice blend to the fish. Add 1/8th of a teaspoon of salt to the fish. Mix well so the seasoning gets all over the fish.",
        "Cook the fish. Cover a baking tray with aluminum foil. Generously rub some of the oil (about 2 tablespoons) over the foil. Place the fish in a single layer on the foil. Preheat oven to 400 degrees Fahrenheit (200 degrees C). Place the fish in the oven and cook for 15-17 minutes.",
        "Blend the tomatoes. Cut the tomatoes into quarters and add to a blender. Blend into a rough paste.",
        "Make the stew. Place a heavy-duty pot (preferably a cast iron pot) on high heat. Add the remaining oil to the pot and let it heat up for 3 minutes. Add the chopped onions to the pot and stir. Let it saute until soft.",
        "Add the blended tomatoes and let it cook while stirring from time to time for 15 to 20 minutes until the tomatoes shrink considerably. Do not let the tomatoes burn.",
        "Add the remaining spice blend to the tomatoes and stir for 2 minutes.",
        "Add in 1 1/2 cups of water, the remaining salt, the white pepper and sprinkle in the Maggi seasoning cubes. Stir well to combine. Add habanero or scotch bonnet pepper if using.",
        "Add the cooked fish carefully into the pot and let everything simmer together for about 5 minutes. Avoid stirring vigorously once the fish is in the pot. Only move the fish pieces around gently to ensure they aren't sticking to the bottom of the pot.",
        "Remove the excess oil. Use a ladle or cook spoon to remove half a cup of oil from the pot. Reserve this oil to use in other recipes like Jollof Rice.",
        "Garnish the stew. Chop the reserved sprig of basil and sprinkle over the stew. Turn off the heat.",
        "Serve. Serve this Tomato Fish Stew with cooked rice, a side of salad and some sweet fried plantains. It is quite a treat!"
      ],
      "notes": [
        "Use super ripe tomatoes with a bright red color so the fish stew isn't too tangy.",
        "Skim out half a cup of oil at the end of cooking to reduce calories. Cooking the tomatoes in this quantity of oil yields great taste.",
        "I used a kind of fish called 'round scad'. I got it from an Asian store. Other kinds of fish like mackerel or croaker fish will work too. Asian stores in the United States mostly carry whole fish. You could also use fish fillets if that works better for you.",
        "Nutritional information is an estimate and takes into consideration the fact that half of the oil is skimmed out at the end of cooking."
      ],
      "nutrition": {
        "calories": 368,
        "carbohydrates": "7g",
        "protein": "2g",
        "fat": "38g",
        "saturated_fat": "3g",
        "polyunsaturated_fat": "11g",
        "monounsaturated_fat": "24g",
        "trans_fat": "0.1g",
        "cholesterol": "0.5mg",
        "sodium": "683mg",
        "potassium": "254mg",
        "fiber": "1g",
        "sugar": "3g",
        "vitamin_a": "719IU",
        "vitamin_c": "16mg",
        "calcium": "25mg",
        "iron": "0.4mg"
      },
      "image": "https://www.preciouscore.com/wp-content/uploads/2020/05/Tomato-Fish-Stew-360x360.jpg"
    },
    {
      "title": "Njanga Rice – Jollof Rice with Palm Oil",
      "description": "Njanga Rice is Jollof Rice with palm oil and crayfish (dried shrimp). It is smoky, spicy and so good.",
      "prep_time": "10 minutes",
      "cook_time": "50 minutes",
      "total_time": "1 hour",
      "servings": 6,
      "course": "Dinner",
      "cuisine": ["African", "Cameroonian", "Nigerian"],
      "author": "Precious",
      "ingredients": [
        "3/4 cup crayfish, loosely packed (see Note 1)",
        "5-7 cloves garlic, peeled",
        "3/4 cup red palm oil (see Note 2)",
        "1 cup chopped onion (from about a medium onion)",
        "2 roma tomatoes, chopped",
        "3 cups jasmine rice or other long-grain rice (see Note 3)",
        "5 cups water",
        "1 teaspoon salt",
        "3 teaspoons chicken bouillon powder (or substitute with 3 small Maggi seasoning cubes or 1 large Maggi crevette)",
        "1/2 teaspoon ground white pepper",
        "2 cups smoked fish, bones removed (substitute with dried fish)",
        "1 habanero pepper"
      ],
      "instructions": [
        "Place the crayfish into a blender and pulse so the crayfish is broken down. Do not grind it into a powder. Just break it down a little bit.",
        "Blend the garlic cloves into a paste.",
        "Place a pot (preferably non-stick) on high heat and pour in the palm oil. Let it heat up for about 3 minutes then add the chopped onions. Stir and saute until translucent, about 2 minutes.",
        "Add the chopped tomatoes to the pot and let it cook while stirring from time to time until it shrinks, about 7 minutes. (While the tomato cooks, wash the rice and set aside.)",
        "Add the blended garlic to the pot and stir so it releases its aroma.",
        "Add the crayfish to the pot and stir for about 30 seconds.",
        "Add the washed rice into the pot and stir so everything is incorporated.",
        "Add in 5 cups of water, 1 teaspoon of salt, 3 teaspoons of chicken bouillon powder, and 1/2 teaspoon of white pepper. Stir to combine.",
        "Add the smoked fish and whole habanero pepper. (Note: If you want the rice spicy, cut the habanero pepper in half before adding it to the pot. I add it whole because my kids can't tolerate so much heat. I press the whole cooked habanero pepper into my plate of rice to make it spicy.)",
        "Cover the pot and turn down the heat to low. Let it cook for 40 minutes then turn off the heat and let it rest covered for 5 minutes.",
        "Open the pot, fluff the rice with a fork, and serve warm."
      ],
      "notes": [
        "Crayfish is dried shrimp from West Africa, available at African stores.",
        "Red palm oil is a natural oil from palm nuts, used widely in West African cooking.",
        "Adjust the quantity of water based on the rice variety used."
      ],
      "nutrition": {
        "Calories": 442,
        "Carbohydrates": 27,
        "Protein": 16,
        "Fat": 30,
        "Saturated Fat": 14,
        "Polyunsaturated Fat": 3,
        "Monounsaturated Fat": 11,
        "Cholesterol": 51,
        "Sodium": 1024,
        "Potassium": 284,
        "Fiber": 1,
        "Sugar": 2,
        "Vitamin A": 243,
        "Vitamin C": 8,
        "Calcium": 49,
        "Iron": 1
      },
      "image": "https://www.preciouscore.com/wp-content/uploads/2020/01/njanga-rice-jollof-rice-with-palm-oil-360x360.jpg"
    },
    {
      "title": "Beef Fried Rice",
      "description": "This Beef Fried Rice is a one-pot wonder, a complete meal with tasty garlicky rice, flavorful browned beef and crisp veggies.",
      "prep_time": "20 minutes",
      "cook_time": "50 minutes",
      "total_time": "1 hour 10 minutes",
      "servings": 8,
      "course": "Dinner",
      "cuisine": ["Fusion"],
      "author": "Precious",
      "ingredients": [
        "5 cloves garlic, peeled",
        "1 inch ginger root, peeled",
        "1 pound beef, cut into 1-inch slices",
        "1/4 teaspoon white pepper",
        "1 teaspoon salt",
        "1 tablespoon corn or vegetable oil (for browning beef)",
        "1/4 cup corn or vegetable oil",
        "1 cup chopped onion",
        "2 cups raw basmati rice",
        "1 teaspoon curry powder",
        "4 cups water (1 liter)",
        "2 seasoning cubes (also called Maggi, substitute with two beef bouillon cubes)",
        "1 large carrot, diced",
        "10 green beans, diced"
      ],
      "instructions": [
        "Blend the garlic and ginger into a paste.",
        "Add 1 teaspoon of the blended garlic and ginger paste to the beef. Sprinkle the white pepper and 1/4 teaspoon of salt over the beef. Mix well so the seasoning goes all over the beef.",
        "Place a pot (preferably a non-stick pot) on high heat and add 1 tablespoon of oil to the pot. Swirl to ensure the oil coats the bottom of the pot. Add half of the beef to the pot in a single layer. Let the beef cook on one side for about 5 minutes or until browned, then flip to the other side and let it cook for another 4 minutes or until browned. Remove the beef from the pot, then add the remaining beef and brown equally.",
        "Add the remaining oil to the pot. Let it heat up (still on high heat) for about 2 minutes. Add the onions and saute while stirring for 2 minutes.",
        "Wash the rice and strain well.",
        "Add the rice to the pot and stir. Let it cook for 5 minutes while stirring continuously so it doesn't burn and the rice fries easily.",
        "Add 1 teaspoon of curry powder to the rice and stir. Add the remaining blended garlic and ginger paste to the rice and stir for about a minute.",
        "Add 4 cups of water, the remaining salt, and seasoning cubes to the rice. Stir to combine. Add the browned beef.",
        "Cut out a large sheet of aluminum foil. Place the lid of the pot over the foil then fold the foil over the ends of the lid.",
        "Place the lid of the pot over the pot and press to ensure the pot is tightly closed.",
        "Turn down the heat to low and let it cook for 15 minutes.",
        "After 15 minutes, open the pot and add the diced carrots and green beans over the rice. Spread to ensure the vegetables are even over the rice. Close the pot then turn off the heat. Let it rest for 5 minutes.",
        "Fluff the rice to ensure it combines well with the vegetables. Serve warm."
      ],
      "notes": [
        "Adjust water quantity if using a different type of rice.",
        "Follow manufacturer's recommended water amount for non-basmati rice."
      ],
      "nutrition": {
        "Calories": 364,
        "Carbohydrates": 41,
        "Protein": 15,
        "Fat": 15,
        "Saturated Fat": 4,
        "Polyunsaturated Fat": 6,
        "Monounsaturated Fat": 5,
        "Trans Fat": 0.4,
        "Cholesterol": 39,
        "Sodium": 353,
        "Potassium": 325,
        "Fiber": 1,
        "Sugar": 2,
        "Vitamin A": 1332,
        "Vitamin C": 3,
        "Calcium": 41,
        "Iron": 2
      },
      "image": "https://www.preciouscore.com/wp-content/uploads/2019/12/Beef-Fried-Rice-360x360.jpg"
    },
    {
      "title": "African Beef Stew",
      "description": "African Beef Stew is quite different from American Beef Stew. The main ingredient is tomato so you may as well call it a tomato stew.",
      "prep_time": "15 minutes",
      "cook_time": "35 minutes",
      "total_time": "50 minutes",
      "servings": 8,
      "course": "Dinner",
      "cuisine": ["African"],
      "author": "Precious",
      "ingredients": [
        "2 pounds beef, chuck roast preferred",
        "8 large roma tomatoes, chopped into chunks",
        "1 large onion, chopped into chunks",
        "1 sprig basil",
        "4 sprigs parsley",
        "3 sprigs celery leaves",
        "1/4 leek (substitute with 3 stems of green onions)",
        "5 cloves garlic, peeled",
        "1 inch ginger root, peeled",
        "1/2 teaspoon ground white pepper",
        "4 stock cubes (4g per cube, substitute with 4-5 teaspoons of bouillon powder)",
        "1 teaspoon salt",
        "1 cup oil, corn oil preferred"
      ],
      "instructions": [
        "Grind the tomatoes and spices. Place the tomatoes, onion, basil, parsley, celery, garlic, and ginger in a blender. Blend into a paste.",
        "Cut the beef into 1 1/2 inch slices and place in a pot.",
        "Add the ground ingredients to the beef. Then add the salt, stock cubes (or bouillon powder), and white pepper. Mix well to combine.",
        "Place the pot on medium-high heat and bring to a boil. Stir then cover and let it cook while stirring from time to time for 30 minutes until the liquid reduces and the tomatoes assume a richer red color.",
        "Add the oil and stir. Taste to ensure seasoning is perfect. Adjust the consistency of your stew by adding a little water if desired. Let it simmer with the oil for about 3 minutes then turn off the heat.",
        "Serve warm with boiled rice or any side of choice."
      ],
      "notes": [
        "Chuck roast is recommended for its fat-to-meat ratio and flavor.",
        "Add habanero or scotch bonnet pepper if desired for heat."
      ],
      "nutrition": {
        "Calories": 477,
        "Carbohydrates": 5,
        "Protein": 23,
        "Fat": 41,
        "Saturated Fat": 8,
        "Polyunsaturated Fat": 9,
        "Monounsaturated Fat": 24,
        "Trans Fat": 1,
        "Cholesterol": 78,
        "Sodium": 868,
        "Potassium": 572,
        "Fiber": 1,
        "Sugar": 3,
        "Vitamin A": 622,
        "Vitamin C": 11,
        "Calcium": 36,
        "Iron": 3
      },
      "image": "https://www.preciouscore.com/wp-content/uploads/2018/10/African-Beef-Stew-360x360.jpg"
    },
    {
      "title": "Coconut Sweet - Toasted Coconut Flakes",
      "description": "Toasting coconut flakes makes it nuttier and tastier. Enjoy toasted coconut flakes as is or add to your favorite cakes, cupcakes, cookies and more!",
      "prep_time": "20 minutes",
      "cook_time": "15 minutes",
      "total_time": "35 minutes",
      "servings": 8,
      "course": "Snack",
      "cuisine": ["Cameroonian"],
      "author": "Precious",
      "ingredients": [
        "1 medium coconut",
        "2 tablespoons granulated sugar, heaped",
        "1/4 cup water"
      ],
      "instructions": [
        "Break coconut open with the blunt side of a butcher knife (note: have a bowl nearby to collect the coconut water). Hold the knife in one hand then hold the coconut in another hand. Hit the coconut with the knife several times around its perimeter until it opens up. Pour coconut water into bowl and set aside.",
        "Place the opened coconut in a microwave and heat on high for 2 minutes. Alternatively, bake it in an oven at 350 degrees F or 180 degrees C for 15 minutes. This process makes separating the coconut flesh from the shell super easy.",
        "Use a pairing (small) knife to lift the flesh from the shell.",
        "Shred the coconut using the small shredding side of a box grater. Alternatively, use the shredding function of your food processor.",
        "Place water and sugar into a non-stick pan on medium heat and stir until sugar is dissolved. Add in shredded coconut and mix well to ensure that it absorbs all of the sugary water. Keep stirring until the coconut turns a beautiful golden brown color, about 15 minutes.",
        "Spread on a tray to cool then enjoy!"
      ],
      "notes": [
        "Coconut Sweet is a popular snack in Cameroon made by cutting coconut into shreds and toasting until brown and crispy."
      ],
      "nutrition": {
        "Calories": 31,
        "Carbohydrates": 4,
        "Protein": 0.2,
        "Fat": 2,
        "Saturated Fat": 2,
        "Polyunsaturated Fat": 0.02,
        "Monounsaturated Fat": 0.1,
        "Sodium": 2,
        "Potassium": 20,
        "Fiber": 1,
        "Sugar": 3,
        "Vitamin C": 0.2,
        "Calcium": 1,
        "Iron": 0.1
      },
      "image": "https://www.preciouscore.com/wp-content/uploads/2017/10/Coconut-Sweet-Toasted-Coconut-Flakes-360x360.jpg"
    },
    {
    "title": "Stewed Pinto Beans",
    "description": "This hearty stewed pinto beans is so tasty, garlicky with a delicious tomato base. Enjoy on boiled rice, with plantains or any side you like. So good!",
    "prep_time": "15 minutes",
    "cook_time": "1 hour 50 minutes",
    "total_time": "2 hours 5 minutes",
    "servings": 10,
    "course": "Main Course",
    "cuisine": "African",
    "author": "Precious",
    "ingredients": [
      "4 cups dried pinto beans",
      "4 large roma tomatoes - chopped",
      "1 1/2 cup oil",
      "1/2 teaspoon garlic powder",
      "1/2 teaspoon ginger powder",
      "1 teaspoon salt",
      "2 stock cubes 4g per cube sub with 2 teaspoons of bouillon powder",
      "1 medium onion - chopped",
      "1 1/2 cups oil"
    ],
    "instructions": [
      "Pick out the bad beans from the beans and discard. (These may be more or less depending on the beans you bought.) Thoroughly rinse beans then soak in water for 2 hours or overnight.",
      "Add more water to the beans as needed until the water completely covers the beans. Boil beans on high heat until tender. This takes about 1 hour 30 minutes. Be sure to check the beans from time to time as it boils and add more water as needed. During the last 30 minutes of boiling the beans, add two teaspoons of salt and continue to cook it.",
      "Let beans rest after being boiled for about 1-2 hours then strain, discard the water in which it was boiled and rinse the beans.",
      "Place oil in a large pot and heat up on high heat for about 3 minutes. Add the chopped onion and saute until fragrant. About 2 minutes.",
      "Add the chopped tomatoes and let it cook, stirring from time to time until the tomato shrinks, start sticking to the bottom of the pot and no longer tastes sour. About 10 to 15 minutes.",
      "Add garlic and ginger powder to the tomatoes and stir then add 1 cup of water. Bring to a simmer.",
      "To the simmering sauce, add the stock cubes or bouillon powder, salt and stir. Finally, add in the boiled beans and stir. Let it simmer together with the other ingredients for 5 to 10 minutes so the flavors meld.",
      "Turn off the heat and serve. Serve this stewed pinto beans with boiled rice, boiled or fried plantains or just anything that makes your heart happy. Enjoy, friends!"
    ],
    "notes": [
      "If you do not want to boil your own beans, you could use pinto beans from a can. If you are using pinto beans from a can, you will need 8 1/2 cups of beans (after boiling 4 cups of dried pinto beans, you get 8 1/2 cups of cooked beans).",
      "To make boiling the beans easier, use a pressure cooker to cook it if you have one.",
      "I mostly keep my pinto beans simple with minimal ingredients because it tastes really great that way. However, if you want to add more ingredients, herbs like a few sprigs of parsley or basil will work well in here. Also, you could blend and use 3 cloves of garlic and half an inch of ginger instead of the powdered versions.",
      "Admittedly, the oil content of this recipe is high and that's because I love it that way. You could reduce the oil to suit you."
    ],
    "nutrition": {
      "calories": 873,
      "carbohydrates": 51,
      "protein": 17,
      "fat": 68,
      "saturated_fat": 5,
      "polyunsaturated_fat": 19,
      "monounsaturated_fat": 43,
      "trans_fat": 0.3,
      "cholesterol": 0.03,
      "sodium": 436,
      "potassium": 1157,
      "fiber": 12,
      "sugar": 3,
      "vitamin_a": 207,
      "vitamin_c": 9,
      "calcium": 93,
      "iron": 4
    },
    "image_url": "https://www.preciouscore.com/wp-content/uploads/2018/09/Stewed-Pinto-Beans-360x360.jpg"
  },
  {
    "title": "Spaghetti Omelette",
    "description": "This spaghetti omelette is the kind of breakfast I dream of having every morning. Loaded with all the nutrients, fresh, filling and insanely delicious!",
    "prep_time": "10 minutes",
    "cook_time": "15 minutes",
    "total_time": "25 minutes",
    "servings": 2,
    "course": "Breakfast",
    "cuisine": "African",
    "author": "Precious",
    "ingredients": [
      "1 1/2 cups boiled spaghetti",
      "4 eggs",
      "1/2 tomato - chopped",
      "1 tablespoon chopped onion",
      "1/4 green bell pepper - chopped",
      "1 seasoning cube (Maggi) 4g cube",
      "1 1/2 tablespoons oil",
      "1/8 teaspoon ground white pepper",
      "2 sprigs parsley - finely chopped"
    ],
    "instructions": [
      "Place tomato, onion, bell pepper, parsley, cracked eggs and white pepper in a bowl. Sprinkle seasoning cube (Maggi) on top. Beat with a fork to combine then add the spaghetti and mix well to combine.",
      "Heat oil in a skillet on high for 2 minutes then reduce the heat to low and pour the spaghetti and egg mixture into the skillet. Spread to ensure that it is evenly distributed in the skillet then let it cook on very low heat for about 8 minutes until the egg sets. Flip to the other side and let it cook for another 3 minutes.",
      "Serve warm!"
    ],
    "notes": [
      "I boiled an 8-ounce pack of spaghetti then measured out a cup and a half for this recipe. You should boil the spaghetti according to the package instructions. Salt your water before boiling and after boiling, do not rinse. That way, no extra salt is needed in the recipe.",
      "Feel free to add some chili pepper or a little freshly chopped habanero pepper if you want some heat in this recipe. OR just serve with some hot sauce on the side.",
      "Customize your spaghetti omelette as you like. You could add other chopped veggies like different colored bell peppers, chopped celery, etc. You could equally add other forms of protein like sausage, ham, canned sardines, or even cheese.",
      "It is key to let the omelette cook on low heat in this recipe. If you let it cook on high heat, the egg will burn without cooking through. So low heat is best to ensure it cooks thoroughly."
    ],
    "nutrition": {
      "calories": 411,
      "carbohydrates": 39,
      "protein": 19,
      "fat": 20,
      "saturated_fat": 4,
      "polyunsaturated_fat": 5,
      "monounsaturated_fat": 10,
      "trans_fat": 0.1,
      "cholesterol": 327,
      "sodium": 754,
      "potassium": 408,
      "fiber": 3,
      "sugar": 4,
      "vitamin_a": 735,
      "vitamin_c": 23,
      "calcium": 94,
      "iron": 4
    },
    "image_url": "https://www.preciouscore.com/wp-content/uploads/2016/03/Spaghetti-Omelette-360x360.jpg"
  },
    {
    "title": "How To Make Plantain Chips",
    "description": "These plantain chips are ultra crispy, so tasty and so addictive! Don't miss all the tips in the blog post above.",
    "prep_time": "20 minutes",
    "cook_time": "20 minutes",
    "total_time": "40 minutes",
    "servings": "6 servings",
    "course": "Snack",
    "cuisine": "International",
    "author": "Precious",
    "ingredients": [
      "3 green plantains (unripe and firm to the touch)",
      "1/2 teaspoon salt",
      "Oil for frying"
    ],
    "instructions": [
      "Peel the plantains. Cut off both tips of a plantain then cut a line across the ridges of a plantain then lift the skin from the cut portion and remove the entire skin with your hands.",
      "Slice the plantains into chips using a mandoline slicer, the slicing side of a box grater or just cut thinly with a knife.",
      "In a small bowl, mix a quarter cup of water and the salt. Set aside.",
      "Place oil in a deep pan up to 4 inches high. Heat the oil on high for about 10 minutes (the oil should be 350 degrees Fahrenheit hot). Turn down the heat to medium then add two tablespoons of the salt water. Add the plantains one after the other. (I added half of the plantains at this point.)",
      "Gently stir the plantains and let them fry in the oil while you stir from time to time for about 5 minutes. After that, remove the chips and place on paper towel to absorb excess oil.",
      "Once the chips are cold, enjoy! You can store plantain chips in an airtight container or Ziploc bag."
    ],
    "notes": [
      "You could use slightly ripe plantains to make plantain chips but please make sure the plantains are still firm to the touch. If they are not firm enough, they won't turn out crispy.",
      "Use salt water as the recipe stipulates instead of sprinkling salt directly on the plantains. This ensures that salt gets into every nook and cranny of the plantain.",
      "Slice the plantains using a mandoline slicer or the slicing side of a box grater. This ensures thin even slices that will cook evenly.",
      "Do not gather the sliced plantains and place them into the oil all at once, I have found that doing it that way leads to several plantains sticking together. When that happens, the plantains that stuck together will turn out soft and not crunchy. So to avoid having soft chips, place your sliced plantains one after the other into the oil. It seems like a lot of work but trust me, it is worth it because by doing so you will get a whole batch of ultra crispy chips! Or add the sliced plantains to the hot oil first then add the salt water to prevent splatters.",
      "Stay far from the oil when placing the salt water in. This is because the salt water causes the oil to splatter and sometimes that could burn you. I always take a step back before placing the salt water into the hot oil."
    ],
    "nutrition": {
      "Calories": "109kcal",
      "Carbohydrates": "29g",
      "Protein": "1g",
      "Fat": "0.3g",
      "Sodium": "197mg",
      "Potassium": "436mg",
      "Fiber": "2g",
      "Sugar": "16g",
      "Vitamin A": "1009IU",
      "Vitamin C": "16mg",
      "Calcium": "3mg",
      "Iron": "0.5mg"
    },
    "image": "https://www.preciouscore.com/wp-content/uploads/2018/03/Homemade-Plantain-Chips-360x360.jpg"
  },
  {
    "title": "How to Make Fufu - Fufu Corn",
    "description": "Fufu Corn is a well-eaten starchy side for soups and vegetables in West Africa. This recipe shows you how to make the perfect Cameroonian corn fufu with the right texture and consistency. With this, even a novice can learn how to make fufu. Enjoy!",
    "prep_time": "10 minutes",
    "cook_time": "20 minutes",
    "total_time": "30 minutes",
    "servings": "8 servings",
    "course": "Main Course",
    "cuisine": "Cameroonian",
    "author": "Precious",
    "ingredients": [
      "4 cups corn flour (500g or half kg)",
      "8 cups water (2 liters)"
    ],
    "instructions": [
      "Place 6 and a half cups of water in a pot and bring to a boil.",
      "Place one cup of the corn flour in a bowl then add 1 cup of water to the flour and mix to form a smooth paste. Add another half cup of water and mix well to form a loose creamy mixture (with the consistency of liquid whole milk).",
      "When water boils, carefully subtract 5 cups of the water, placing it in a hot water safe container. Then stir the remaining water in the pot with a wooden spoon while adding the corn flour mixture. Add in all of the mixture, while stirring continuously so as to avoid forming lumps. The mixture will thicken up as you stir. This mixture will form the base so we can easily mix in the rest of the flour without forming lumps.",
      "Now add half of the flour and mix well to incorporate. Add the other half and mix well till well incorporated. The mixture will be harder at this point and it is a bit of a workout but you got this!",
      "Once the flour is all mixed in, add half of the reserved hot water to the pot. Cover and let it cook for 5 minutes on medium heat. After that, open and mix the fufu with the water in circular motion until well incorporated. Add the remaining hot water then cover and let it cook for another 5 minutes. Cover and mix the fufu again with the hot water until well incorporated. Now let it cook for about 3 minutes and your corn fufu is done!"
    ],
    "notes": [
      "If you live out of Cameroon, corn flour may be hard to come by. A good replacement for this is semolina. With semolina, the cooking process remains the same.",
      "I highly recommend you watch the video to fully understand how to make corn fufu."
    ],
    "nutrition": {
      "Calories": "212kcal",
      "Carbohydrates": "44g",
      "Protein": "5g",
      "Fat": "2g",
      "Saturated Fat": "0.3g",
      "Polyunsaturated Fat": "1g",
      "Monounsaturated Fat": "1g",
      "Sodium": "15mg",
      "Potassium": "153mg",
      "Fiber": "4g",
      "Sugar": "1g",
      "Vitamin A": "3IU",
      "Calcium": "86mg",
      "Iron": "1mg"
    },
    "image": "https://www.preciouscore.com/wp-content/uploads/2018/02/How-to-Make-Fufu-Fufu-Corn-360x360.jpg"
  },
    {
      "title": "Beignets Souffles",
      "description": "I loved buying beignets souffles from bakeries back home in Cameroon. It has a crunchy exterior, the inside tastes like cake. It is good with coffee or tea. Enjoy, friends!",
      "prep_time": "10 minutes",
      "cook_time": "15 minutes",
      "total_time": "25 minutes",
      "servings": "18 servings",
      "course": "Snack",
      "cuisine": "Cameroonian",
      "author": "Precious",
      "ingredients": [
        "4 cups flour (1/2 kg or 500g)",
        "4 eggs",
        "1/4 cup oil (60ml)",
        "1 teaspoon baking powder",
        "1 cup liquid milk (240 ml) use evaporated milk for best flavor",
        "1/2 cup granulated sugar (100g)",
        "Pinch of salt",
        "1 teaspoon vanilla extract",
        "1/2 teaspoon ground nutmeg",
        "Oil for frying About 1-2 liters of oil"
      ],
      "instructions": [
        "In a large bowl, mix together sugar and oil. Add in eggs, milk and vanilla extract then whisk together. Add the flour, baking powder, salt and nutmeg. Mix to form a thick batter.",
        "Pour oil up to about 2/3 of a deep frying pan. Heat oil on high heat for about 10 minutes (up to 375 degrees F/190 degrees C). Turn down the heat to medium heat them gently drop tablespoons full of the batter into the oil. Drop about ten tablespoons full for the first batch then drop in the rest of the batter for the second batch.",
        "Let the balls cook for about 7-10 minutes until they are a deep brown color. Be sure to turn them from time to time. Remove and place on paper towel to absorb excess oil."
      ],
      "notes": [
        "The temperature of the oil is key in this recipe. If your oil is too hot, the beignets souffles will burn quickly on the outside without getting cooked on the inside. So be sure to follow my exact directions for heating the oil - heat it on high for about 10 minutes then turn down the heat to medium before putting in the balls. The heat should remain at medium throughout the cooking process.",
        "You could add other flavors like orange/lemon zest to your batter."
      ],
      "nutrition": {
        "Calories": "173 kcal",
        "Carbohydrates": "28 g",
        "Protein": "5 g",
        "Fat": "5 g",
        "Saturated Fat": "1 g",
        "Polyunsaturated Fat": "1 g",
        "Monounsaturated Fat": "2 g",
        "Trans Fat": "0.02 g",
        "Cholesterol": "38 mg",
        "Sodium": "43 mg",
        "Potassium": "64 mg",
        "Fiber": "1 g",
        "Sugar": "6 g",
        "Vitamin A": "75 IU",
        "Vitamin C": "0.002 mg",
        "Calcium": "40 mg",
        "Iron": "1 mg"
      },
      "image": "https://www.preciouscore.com/wp-content/uploads/2018/02/Beignets-Souffles-360x360.jpg"
    },
    {
      "title": "Cameroon Banana Cake Recipe",
      "description": "This is Cameroon Banana cake as I enjoyed while growing up. It is great for snacking, breakfast, parties or for entertaining guests. It is also a great way to use up overripe bananas. Hope you enjoy this recipe!",
      "prep_time": "10 minutes",
      "cook_time": "20 minutes",
      "total_time": "30 minutes",
      "servings": "12 cupcakes",
      "course": "Dessert",
      "cuisine": "Cameroonian",
      "author": "Precious",
      "ingredients": [
        "2 large bananas or 3 small bananas",
        "1 1/2 cups flour",
        "1/4 cup of vegetable oil",
        "2 large eggs",
        "1/4 cup sugar",
        "1/2 teaspoon baking soda",
        "1/2 teaspoon baking powder",
        "1/2 teaspoon cinnamon powder or nutmeg (optional)",
        "A pinch of salt"
      ],
      "instructions": [
        "Prepare your baking tins by greasing or by lining with cupcake liners then set your oven to 350 Degrees Fahrenheit (About 176 Degrees Celsius).",
        "Peel your dejected bananas and dump in a blender. Add in some water (about a quarter cup) and blend. If you are feeling like an Ajebota, use liquid milk to blend instead of water. Put that in your mixing bowl.",
        "Now crack open your eggs and dump in. Pour in the vegetable oil. Give that a really good mix.",
        "Now throw in flour, sugar, salt, baking powder and baking soda. Mix until everything is in harmony.",
        "Fill your prepared baking tin with the batter trying to make sure each cup has about the same amount of batter. Fill each to about 2/3rd.",
        "Bake in the preheated oven for about 20 minutes or until a toothpick inserted in one of the cakes comes out clean."
      ],
      "notes": [
        "If you wish, you could use this same recipe and bake one large cake. It should bake well in a 9-inch pan."
      ],
      "nutrition": {
        "Calories": "175 kcal",
        "Carbohydrates": "23 g",
        "Protein": "4 g",
        "Fat": "8 g",
        "Saturated Fat": "2 g",
        "Polyunsaturated Fat": "3 g",
        "Monounsaturated Fat": "2 g",
        "Trans Fat": "0.03 g",
        "Cholesterol": "27 mg",
        "Sodium": "292 mg",
        "Potassium": "118 mg",
        "Fiber": "2 g",
        "Sugar": "8 g",
        "Vitamin A": "52 IU",
        "Vitamin C": "2 mg",
        "Calcium": "59 mg",
        "Iron": "1 mg"
      },
      "image": "https://www.preciouscore.com/wp-content/uploads/2016/05/Cameroon-banana-cake-recipe-360x360.jpg"
    },
    {
  "title": "Goat Meat Pepper Soup Recipe",
  "description": "A hearty soup cooked with goat meat, herbs and spices. This Goat Meat Pepper Soup recipe is so easy to make and perfect for cold days.",
  "prep_time": "15 minutes",
  "cook_time": "50 minutes",
  "total_time": "1 hour 5 minutes",
  "servings": 6,
  "course": "Soup",
  "cuisine": "African",
  "author": "Precious",
  "ingredients": [
    "2 pounds goat meat cubes (1kg)",
    "1 habanero pepper",
    "1 medium onion - roughly chopped",
    "1 teaspoon whole white pepper",
    "35 njangsa seeds",
    "5 cloves garlic - peeled",
    "1 stem green onion - roughly chopped",
    "1 stem parsley",
    "1 stem celery (use half or a quarter if the celery is large)",
    "1 inch ginger root - peeled",
    "1 teaspoon salt",
    "2 seasoning cubes (Maggi) about 4g per cube"
  ],
  "instructions": [
    "Rinse meat thoroughly and place in a pot. Add water to the level of the meat (about 3 cups). Bring to a boil on medium heat. Let the meat boil for 20 minutes.",
    "Place the Njangsa seeds and white pepper in a blender. Grind into a powder. Add celery, parsley, ginger, garlic, pepper, and onions. Add about half a cup of water and blend into a paste.",
    "After meat boils for 20 minutes, add in salt, seasoning cubes (Maggi), and spice blend. Mix well.",
    "Cover and let it cook for about 20-30 minutes more until the goat is tender and easy to chew.",
    "Check the consistency of the soup. If it is too thick, add more water to achieve the desired consistency.",
    "Serve warm as it is or with any starchy side of choice."
  ],
  "notes": [
    "You can pair it up with any side you like: African white yams and French bread are other sides that go well with this soup.",
    "Nutritional information: Calories - 189kcal, Carbohydrates - 4g, Protein - 20g, Fat - 10g, Sodium - 779mg"
  ],
  "image": "https://www.preciouscore.com/wp-content/uploads/2017/11/Goat-Meat-Pepper-Soup-Recipe-360x360.jpg"
  },
    {
  "title": "Groundnut Pudding - African Spicy Peanut Butter",
  "description": "Cameroonian groundnut paste, also known as 'Mboh', is a pudding-like savory meal made with roasted peanuts. It is spicy, peanuty and insanely good!",
  "prep_time": "15 minutes",
  "cook_time": "15 minutes",
  "total_time": "30 minutes",
  "servings": 8,
  "course": "Side Dish",
  "cuisine": "Cameroonian",
  "author": "Precious",
  "ingredients": [
    "3 cups groundnuts (peanuts)",
    "1/2 cup crayfish (ground)",
    "1 habanero pepper",
    "2 seasoning cubes (Maggi) or 1 large Maggi crevette",
    "1 teaspoon salt",
    "3 cups water",
    "1 cup dried fish (optional) I used dried anchovies"
  ],
  "instructions": [
    "Place groundnuts in a wide frying pan or pot and roast on medium heat for about 15 minutes, stirring constantly until browned.",
    "Let the roasted groundnuts cool completely, then grind into a powder using a blender or coffee grinder.",
    "Blend habanero pepper with 2 tablespoons of water.",
    "Mix ground groundnuts with 1.5 cups of water to make a paste.",
    "In a pot, boil 1 cup of water with crayfish and dried fish (if using).",
    "Add salt, Maggi cubes, blended habanero pepper, and groundnut paste. Mix well, then add remaining half cup of water.",
    "Boil the mixture, stirring constantly, until the oil from the groundnuts begins to show and the mixture thickens.",
    "Serve with any starchy side of your choice."
  ],
  "notes": [
    "Nutritional information: Calories - 414kcal, Carbohydrates - 9g, Protein - 36g, Fat - 28g, Sodium - 2639mg",
    "You can enjoy this with bobolo, plantains, yams, potatoes, or bread."
  ],
  "image": "https://www.preciouscore.com/wp-content/uploads/2017/11/Groundnut-Paste-Mboh-360x360.jpg"
}

  ]
}
